In [1]:
#Series versus 1-column DataFrame
import pandas as pd

In [2]:
df=pd.read_csv('sales.csv',index_col='month')

In [3]:
df

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0
Mayo        132   NaN   52.0
Junio       205  60.0   55.0

In [4]:
#Transforming DataFrames

In [5]:
df.floordiv(12)

         huevos  sal  jamon
month
Enero         3  1.0    1.0
Febrero       9  4.0    2.0
Marzo        18  7.0    6.0
Abril         6  7.0    1.0
Mayo         11  NaN    4.0
Junio        17  5.0    4.0

In [6]:
#NumPy vectorized functions

In [7]:
import numpy as np

In [9]:
np.floor_divide(df,12)

         huevos  sal  jamon
month
Enero       3.0  1.0    1.0
Febrero     9.0  4.0    2.0
Marzo      18.0  7.0    6.0
Abril       6.0  7.0    1.0
Mayo       11.0  NaN    4.0
Junio      17.0  5.0    4.0

In [10]:
#aplicado con funciones

In [11]:
def dozens(n):
    return n//12

In [12]:
df.apply(dozens)

         huevos  sal  jamon
month
Enero         3  1.0    1.0
Febrero       9  4.0    2.0
Marzo        18  7.0    6.0
Abril         6  7.0    1.0
Mayo         11  NaN    4.0
Junio        17  5.0    4.0

In [13]:
#Plain Python functions

In [15]:
df.apply(lambda n:n//12)

         huevos  sal  jamon
month
Enero         3  1.0    1.0
Febrero       9  4.0    2.0
Marzo        18  7.0    6.0
Abril         6  7.0    1.0
Mayo         11  NaN    4.0
Junio        17  5.0    4.0

In [16]:
#Storing a transformation

In [17]:
df['docena_de_huevos']=df.huevos.floordiv(12)

In [18]:
df

         huevos   sal  jamon  docena_de_huevos
month
Enero        47  12.0   17.0                 3
Febrero     110  50.0   31.0                 9
Marzo       221  89.0   72.0                18
Abril        77  87.0   20.0                 6
Mayo        132   NaN   52.0                11
Junio       205  60.0   55.0                17

In [19]:
#The DataFrame index

In [20]:
df.index

Index(['Enero', 'Febrero', 'Marzo', 'Abril', 'Mayo', 'Junio'], dtype='object', name='month')

In [21]:
#Working with string values

In [22]:
df.index=df.index.str.upper()

In [23]:
df.index

Index(['ENERO', 'FEBRERO', 'MARZO', 'ABRIL', 'MAYO', 'JUNIO'], dtype='object', name='month')

In [26]:
df.index=df.index.map(str.lower)

In [27]:
df.index

Index(['enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio'], dtype='object', name='month')

In [28]:
#Defining columns using other columns

In [31]:
df['huevos_salados']=df.sal+df.docena_de_huevos

In [32]:
df

         huevos   sal  jamon  docena_de_huevos  huevos_salados
month
enero        47  12.0   17.0                 3            15.0
febrero     110  50.0   31.0                 9            59.0
marzo       221  89.0   72.0                18           107.0
abril        77  87.0   20.0                 6            93.0
mayo        132   NaN   52.0                11             NaN
junio       205  60.0   55.0                17            77.0